       ENTRY-SECTION SECTION.
       MAIN-ENTRY.
           PERFORM INITIALIZATION-SECTION
           PERFORM MENU-SECTION
           PERFORM FINALIZE-SECTION
           GOBACK.

