       MAIN-SECTION SECTION.
           COPY "../sections/index-section.cpy".
           COPY "../sections/logging-section.cpy".
           COPY "../sections/initialization-section.cpy".
           COPY "../sections/menu-section.cpy".
           COPY "../sections/client-section.cpy".
           COPY "../sections/account-section.cpy".
           COPY "../sections/report-section.cpy".
           COPY "../sections/finalize-section.cpy".
           COPY "../sections/utility-section.cpy".
           COPY "../sections/entry-section.cpy".

